[
  {
    "code": "cornus_alba",
    "desc": "Dereń biały jest gatunkiem egzotycznym, pochodzącym z Syberii i północnych Chin, wprowadzonym w Europie do celów ozdobnych. Jest to szybko rosnący krzew liściasty, który może dorastać do 3 m wysokości i w dojrzałym wieku wykształcać szeroko zaokrągloną koronę. Zwykle w warunkach miejskich osiąga wiek 40 lat. Jego czerwona kora, niezwykle jaskrawa w zimie, jest prawdopodobnie najlepszą ozdobną cechą tego gatunku. Ma proste, jajowate lub eliptyczne liście z nerwami zbiegającymi się u wierzchołka liścia. Liście osadzone są naprzeciwlegle. Małe, kremowe kwiaty zebrane w baldachogrona, pojawiają się późną wiosną, a kuliste niebieskawobiałe owoce dojrzewają pod koniec lata.\nRośnie dobrze w umiarkowanym ocienieniu. Jest bardzo wytrzymały na mrozy (do -40°C) i dobrze przystosowany do gleb ubogich, ale o właściwej strukturze i uwilgotnieniu.",
    "assimilated": "Cornus sp.,Cornus florida 'Cherokee Chief',Cornus mas,Cornus sanguinea",
    "id": 238,
    "name_latin": "Cornus alba",
    "name": "Dereń biały",
    "co_absorbed": "1/10",
    "pm_removed": "1/10",
    "energy_saved": "1/10",
    "number_of_trees": 8
  },
  {
    "code": "quercus_robur",
    "desc": "Dąb szypułkowy jest gatunkiem rodzimym w Europie. Jest to gatunek liściasty o średnim tempie wzrostu, który w dojrzałości może osiągnąć wysokość 40 m. Korona może być szeroka, zaokrąglona lub - w przypadku odmiany 'Fastigiata' - kolumnowa. Jest gatunkiem wybitnie długowiecznym, w warunkach miejskich jego wiek może przekraczać 500 lat. Ma proste, klapowane liście, osadzone naprzemianlegle. W pobliżu ogonka liść ma dwa charakterystyczne okrągławe „uszka”, co pozwala odróżnić ten gatunek od podobnego dębu bezszypułkowego Q. petraea. Kwitnie w kwietniu i maju. Kwiaty mają znikomą wartość ozdobną. Owocami są żołędzie utrzymywane na długich szypułkach. Drewno jest bardzo cenne i szeroko stosowane do wyrobu beczek i mebli.\nRośnie dobrze w pełnym słońcu, podczas gdy w zacienionych warunkach jest często infekowany przez patogeny liści (tj. mączniaka). Jest wytrzymały (do -30°C), ponieważ kiełkuje późną wiosną. Preferuje gleby piaszczyste lub gliniaste, o pH między 6,5 a 7,5. Po adaptacji toleruje dobrze susze, zasolenie, podtopienia i zanieczyszczenie powietrza, ale cierpi z powodu długotrwałego i ciężkiego stresu po przesadzeniu. Drewno jest bardzo gęste i odporne na próchnienie.",
    "assimilated": "Quercus robur 'Fastigiata',Quercus robur 'Fastigiata Koster',Quercus robur 'Pendula',Quercus sp.,Quercus cerris,Quercus frainetto,Quercus palustris,Quercus petraea,Quercus rubra",
    "id": 102,
    "name_latin": "Quercus robur",
    "name": "Dąb szypułkowy",
    "co_absorbed": "10/10",
    "pm_removed": "8/10",
    "energy_saved": "10/10",
    "number_of_trees": 3340
  },
  {
    "code": "sorbus_aucuparia",
    "desc": "Jarząb pospolity jest gatunkiem rodzimym w Europie, gdzie rośnie głównie w zimnym klimacie i w obszarach górskich. Jest to wolno rosnącym gatunkiem liściastym, który w wieku dojrzałym może osiągać do 12 m wysokości i wytwarzać zaokrągloną koronę. W warunkach miejskich jest krótkowieczny i rzadko żyje dłużej niż 40 lat. Posiada liście złożone zwykle z 7 piłkowanych listków, przebarwiające się jesienią na kolor żółty. Kwitnie od maja do czerwca. Białe kwiaty tworzą baldachogrona. Owoc jest koralowo czerwonym owocem rzekomym o wysokich walorach ozdobnych i znaczeniu dla bioróżnorodności.\nRośnie w różnych warunkach nasłonecznienia. Jest wytrzymały na mrozy (do -30°C) i dobrze przystosowany do gleb płytkich, piaszczystych i gliniastych, w zakresie pH 5,0-7,5. Jest stosunkowo łatwy do przesadzania, ale wykazuje słabą tolerancję na typowe czynniki stresowe warunków miejskich, w tym suszę, zasolenie i podtapianie. Jest również wrażliwy na biotyczne czynniki stresowe, które mogą powodować wczesny i rozległy spadek liczby drzew tego gatunku.",
    "assimilated": "Sorbus aucuparia 'Fastigiata',Sorbus aucuparia Pendula',Sorbus sp.,Sorbus ×arnoldiana 'Golden Wonder',Sorbus commixta",
    "id": 155,
    "name_latin": "Sorbus aucuparia",
    "name": "Jarząb pospolity",
    "co_absorbed": "1/10",
    "pm_removed": "2/10",
    "energy_saved": "1/10",
    "number_of_trees": 771
  },
  {
    "code": "fraxinus_excelsior",
    "desc": "Jesion wyniosły jest gatunkiem rodzimym w Europie. Jest to gatunek liściasty o średnim tempie wzrostu, ale osiągającym w wieku dojrzałym wyjątkowo pokaźne rozmiary, ponieważ może dorastać do 45 m (Puszcza Białowieska), rozwijając stożkowatą lub kopulastą, ażurową koronę. W warunkach miejskich może żyć dłużej niż 120 lat. Ma nieparzystopierzaście złożone zazwyczaj z 9-11 listków liście, które są osadzone naprzeciwlegle. Liście jesienią opadają zielone, bez wyraźnego przebarwiania się. Pączki – w odróżnieniu od innych gatunków jesionów - czarne. Zakwita w kwietniu, przed listnieniem. Owocami są pojedyncze skrzydlaki – samary, skupione w obfitych pęczkach. Ask i Embla – pierwsi mężczyzna i kobieta stworzeni przez bogów w mitologii nordycko-germańskiej, to kłody jesionu i wiązu (drzew „nieposiadających kwiatów”) wzbogacone o duszę, rozum i zmysły. Nawet Yggdrasil, drzewo świata, które wspiera cały kosmos w tej mitologii, jest jesionem.\nRośnie dobrze w pełnym słońcu i w umiarkowanym cieniu. Jest dość wytrzymały na mrozy (do -30°C) i rozwija się w glebach alkalicznych. Gatunek ten jest umiarkowanie trudny do przeszczepu i słabo toleruje suszę i ciepło, ale jest tolerancyjny dla zanieczyszczeń i ma silną strukturę, z niewielkimi wymaganiami przycinania. Jest podatny na specyficzne szkodniki i patogeny, które mogą powodować rozległy spadek drzew tego gatunku.",
    "assimilated": "Fraxinus excelsior 'Altena',Fraxinus excelsior 'Atlas',Fraxinus excelsior 'Nana',Fraxinus excelsior 'Pendula',Fraxinus sp.,Fraxinus americana,Fraxinus pennsylvanica,Fraxinus pennsylvanica 'Crispa'",
    "id": 34,
    "name_latin": "Fraxinus excelsior",
    "name": "Jesion wyniosły",
    "co_absorbed": "8/10",
    "pm_removed": "7/10",
    "energy_saved": "7/10",
    "number_of_trees": 9192
  },
  {
    "code": "aesculus_hippocastanum",
    "desc": "Kasztanowiec biały (kasztanowiec zwyczajny, kasztanowiec pospolity) jest gatunkiem egzotycznym, pochodzącym z Azji i z Bałkanów, obecnie szeroko zadomowionym w Europie (w Polsce od XVI wieku). Jest to szybko rosnące drzewo liściaste, dorastające w Polsce zazwyczaj do około 20-25 m wysokości (maksymalnie 30 m), o koronie w młodości stożkowatej, a wieku dojrzałym szeroko zaokrąglonej. Zwykle w warunkach miejskich żyje do 75 lat (najstarszy kasztanowiec w Polce liczy ponad 260 lat). Liście są naprzeciwległe o długich (do 20 cm) ogonkach, dłoniastodzielne, złożone z 5-7 listków. Kwitnienie rozpoczyna na przełomie kwietnia i maja, wykształcając efektowne, owadopylne kwiatostany. Z poszczególnych kwiatostanów rozwija zaledwie kilka kolczastych owoców, zawierających po jednym kulistym, rzadziej po dwa lub po trzy (maksymalnie cztery) bocznie spłaszczone nasiona we wspólnej torebce. Ewentualne spożycie owoców przez człowieka, w odróżnieniu od kasztanów jadalnych, może powodować dolegliwości układu pokarmowego. W medycynie, ze względu na właściwości lecznicze kasztanowca, stosowane są na ogół zewnętrznie preparaty zawierające wyciągi z różnych części tej rośliny.\nRośnie dobrze w pełnym słońcu. Jest wytrzymały na mróz (do -30°C) i dobrze przystosowany do ubogich gleb w zakresie pH 5,5-8,0, za wyjątkiem gleb bardzo suchych. Gatunek ten jest dość trudny do przesadzania, słabo toleruje suszę i podtopienia. Jest podatny na szkodniki i patogeny, które mogą powodować przedwczesną defoliację. Słabo toleruje przycinanie ze względu na niską zdolność do kompartmentacji (grodziowania), źle znosi uszkodzenia korzeni.",
    "assimilated": "Aesculus hippocastanum 'Baumannii',Aesculus sp.,Aesculus ×carnea,Aesculus ×carnea 'Briotii',Aesculus flava",
    "id": 30,
    "name_latin": "Aesculus hippocastanum",
    "name": "Kasztanowiec zwyczajny",
    "co_absorbed": "5/10",
    "pm_removed": "4/10",
    "energy_saved": "4/10",
    "number_of_trees": 1922
  },
  {
    "code": "acer_platanoides",
    "desc": "Klon zwyczajny (klon pospolity) jest gatunkiem rodzimym w Europie, rozpowszechnionym od Hiszpanii po Skandynawię. Jest szybko rosnącym drzewem liściastym, dorastającym w Polsce do 28,5 m wysokości, wykształcającym w dojrzałym wieku, w zależności od odmiany, koronę szeroką i zaokrągloną, lub też węższą i stożkowatą. W miastach może osiągać wiek 75 lat, ale żywotność jest często skracana jest przez czynniki stresowe, takie jak grzyby i nadmierne zasolenie gleby. Liście naprzeciwległe, dłoniasto-klapowane, o pięciu, rzadziej siedmiu klapach z ostrymi wierzchołkami. Niektóre odmiany wykazują trwałe lub przejściowo czerwono zabarwione liście. Niezwykle atrakcyjne jest przebarwianie liści jesienią na jasnożółty, wręcz złoty kolor. Kwitnie przed rozwojem liści w kwietniu i w maju. Żółtozielonkawe kwiaty zapylane są przez owady. Owocami są podwójne skrzydlaki (ulistnione orzeszki), o szerokim kącie rozwarcia (>120°).\nRośnie dobrze w pełnym słońcu lub w półcieniu. Jest niezwykle mrozoodporny (do -40°C) i dobrze przystosowany do ubogich i zagęszczonych gleb w zakresie pH 5,5-8,0. Jest gatunkiem łatwym do przesadzania.",
    "assimilated": "Acer platanoides 'Drummondii',Acer platanoides 'Faassen's Black',Acer platanoides 'Globosum',Acer platanoides 'Princenton Gold',Acer platanoides 'Royal Red',Acer platanoides 'Schwedleri',Acer sp.,Acer pseudoplatanus,Acer pseudoplatanus 'Atropurpureum',Acer pseudoplatanus 'Aureum',Acer pseudoplatanus 'Erectum',Acer pseudoplatanus 'Leopoldii',Acer pseudoplatanus 'Negenia',Acer pseudoplatanus 'Purpureum',Acer pseudoplatanus 'Rotterdam',Acer rubrum,Acer rubrum 'Red Sunset'",
    "id": 132,
    "name_latin": "Acer platanoides",
    "name": "Klon zwyczajny",
    "co_absorbed": "3/10",
    "pm_removed": "4/10",
    "energy_saved": "2/10",
    "number_of_trees": 10478
  },
  {
    "code": "tilia_cordata",
    "desc": "Lipa drobnolistna jest gatunkiem rodzimym w Europie. Jest to gatunek liściasty o średnim tempie wzrostu, który w wieku dojrzałym może dorastać do 35 m. Korona może być owalna lub stożkowata, w zależności od odmiany. W miastach może żyć ponad 120 lat. Proste, sercowate liście osadzone są na pędach skrętolegle. Liście są nagie, z wyjątkiem widocznych na spodniej stronie kilku brązowawych kępek włosków u zbiegu unerwienia. Kwitnie w czerwcu i lipcu. Kwiaty są kremowe, silnie pachnące i bardzo atrakcyjne dla pszczół. Są one często stosowane w medycynie. Kwiaty są zorientowane w górę w odniesieniu do liścia osadzonego w tym samym węźle, co pozwala odróżnić ten gatunek od mieszańców (Tilia × europaea) i lipy szerokolistnej T. platyphyllos. Owocem jest filcowato omszony niemal kulisty orzeszek bez wyraźnych żeberek.\nRośnie dobrze w umiarkowanym ocienieniu. Jest wytrzymała na mróz (do -30°C) i dobrze rośnie w glebach o dowolnej strukturze w zakresie pH 5,5-7,5. Jest niezwykle łatwa do przesadzania i mało wrażliwa na zanieczyszczenia powietrza. Latem mogą wystąpić pewne uciążliwości, jeśli liście zostaną pokryte spadzią wytwarzaną przez mszyce.",
    "assimilated": "Tilia cordata 'Green Globe',Tilia cordata 'Greenspire',Tilia cordata 'Rancho',Tilia sp.,Tilia ×europaea,Tilia ×europaea 'Euchlora',Tilia ×europaea 'Pallida',Tilia americana,Tilia 'Euchlora',Tilia platyphyllos,Tilia platyphyllos 'Fastigiata',Tilia platyphyllos 'Laciniata',Tilia platyphyllos 'Pyramidalis',Tilia platyphyllos subsp. cordifolia,Tilia platyphyllos 'Vitifolia',Tilia tomentosa,Tilia tomentosa 'Brabant',Tilia tomentosa 'Varsaviensis'",
    "id": 111,
    "name_latin": "Tilia cordata",
    "name": "Lipa drobnolistna",
    "co_absorbed": "6/10",
    "pm_removed": "2/10",
    "energy_saved": "5/10",
    "number_of_trees": 8395
  },
  {
    "code": "pinus_nigra",
    "desc": "Sosna czarna jest gatunkiem rodzimym w Europie południowej. Jest to wiecznie zielone drzewo o średnim tempie wzrostu, które może osiągnąć do 25 m wysokości w dojrzałości i rozwijać szeroko stożkowatą koronę. Igły są w parach. Mają do 12 cm długości i ciemnozielony kolor. Szyszki mają do 12 cm długości i są osadzone prostopadle do pędów na krótkich trzonkach.\nSosna czarna uznawana jest dziś za gatunek reliktowy, który rozwijał się w ostatniej epoce lodowcowej, ale który obecnie zanika z powodu zmian klimatycznych. Słabo toleruje ciepło i na południu Europy zwykle nie jest uprawiany na obszarach miejskich, za wyjątkiem Alp (np. w Innsbrucku można znaleźć weteranów). Nie należy do gatunków łatwych do przesadzania i słabo toleruje zanieczyszczenie powietrza, aczkolwiek w warunkach miejskich Europy środkowo-wschodniej radzi sobie nie najgorzej.",
    "assimilated": "Pinus sp.,Pinus cembra,Pinus heldreichii,Pinus peuce,Pinus ponderosa,Pinus strobus,Pinus sylvestris,Pinus wallichiana",
    "id": 76,
    "name_latin": "Pinus nigra",
    "name": "Sosna czarna",
    "co_absorbed": "",
    "pm_removed": "4/10",
    "energy_saved": "",
    "number_of_trees": 351
  },
  {
    "code": "populus_nigra",
    "desc": "Topola czarna jest gatunkiem rodzimym w Europie. Jest to niezwykle szybko rosnący gatunek liściasty, który może w dojrzałym wieku osiągnąć wysokość 25 m. Korona może być szeroka lub kolumnowa w przypadku odmiany ‘Italica’ czyli tzw. topoli włoskiej. W warunkach miejskich jest drzewem krótkowiecznym, tu rzadko przekracza 40 lat. Liście ma pojedyncze, trójkątne do romboidalnych. Kwitnie od lutego do kwietnia. Męskie i żeńskie kwiaty pojawiają się na różnych osobnikach, więc sadzenie osobników męskich pozwala uniknąć uciążliwości związanych z obfitującymi w puch nasionami. Topola czarna jest szeroko uprawiana dla drewna i jest męskim rodzicem klona Populus × canadensis ‘I-214’, najbardziej popularnego w przemyśle drzewnym na całym świecie.\nRośnie dobrze w pełnym słońcu. Jest wytrzymała na spadki temperatury (do -30°C) i dobrze przystosowana do gleb podmokłych i zbitych, w zakresie pH 5,0-8,5. Korzenie mogą wypierać nawierzchnie pobliskich chodników.",
    "assimilated": "Populus nigra 'Italica',Populus nigra 'Plantierensis',Populus sp.,Populus ×'Androscoggin',Populus ×berolinensis,Populus ×berolinensis 'Berlin',Populus ×berolinensis 'Petrowskyana',Populus ×canadensis,Populus ×canadensis 'Flachslanden',Populus ×canadensis 'Gelrica',Populus ×canadensis 'Grandis',Populus ×canadensis 'Marilandica',Populus ×canadensis 'Robusta',Populus ×canescens,Populus ×'Hybrida 194',Populus ×'Hybrida 275',Populus ×'Hybrida 277',Populus alba,Populus alba 'Pyramidalis',Populus balsamifera,Populus maximowiczii,Populus simonii,Populus simonii 'Fastigiata',Populus tremula,Populus tremula 'Erecta'",
    "id": 87,
    "name_latin": "Populus nigra",
    "name": "Topola czarna",
    "co_absorbed": "2/10",
    "pm_removed": "1/10",
    "energy_saved": "2/10",
    "number_of_trees": 302
  },
  {
    "code": "ulmus_laevis",
    "desc": "Wiąz szypułkowy (limak) jest gatunkiem rodzimym w Europie środkowej i Północnej. Jest to gatunek liściasty o szybkim tempie wzrostu, który może dorastać do 25 m. Korona w zarysie owalna. W miastach jest to drzewo na ogół długowieczne, ale żywotność może być skrócona przez infekcje, które mogą powodować rozległe straty drzew tego gatunku. Liście są pojedyncze, jajowate, o podwójnie piłkowanym brzegu, delikatnie owłosione na dolnej stronie. Liście są wyraźnie asymetryczne w pobliżu krótkiego ogonka. Zakwita przed rozwojem liści pod koniec marca lub w kwietniu. Kwiaty nie mają płatków, to też nie są zbyt dekoracyjne. Owoc zwisający na długiej szypułce jest okrągławym skrzydlakiem, zwykle o średnicy około 1 cm, ze spłaszczonym orzeszkiem pośrodku i widocznymi krótkimi rzęskami wzdłuż brzegów skrzydełka. \nRośnie dobrze w pełnym słońcu. Jest niezwykle wytrzymały na mrozy (do -40°C) i dobrze rośnie w każdym rodzaju gleby w zakresie pH 5,5-8,0. Jest bardzo łatwy do przesadzania i bardzo tolerancyjny na zanieczyszczenia powietrza.",
    "assimilated": "Ulmus sp.,Ulmus ×hollandica,Ulmus glabra,Ulmus minor,Ulmus minor 'Jacqueline hillier'",
    "id": 118,
    "name_latin": "Ulmus laevis",
    "name": "Wiąz szypułkowy",
    "co_absorbed": "6/10",
    "pm_removed": "7/10",
    "energy_saved": "6/10",
    "number_of_trees": 2835
  }
]
